# Tayler Stegman
## Week 12 11/7/2023
### Python - Pandas Series and DataFrame

## Key Features of Pandas
- Fast and efficient DataFrame with default and customized indexing
- Load data with different file formats
- Data alignment and integrated handling of missing data
- Reshaping and pivoting of data sets
- Label-based slicing. Indexing and subsetting of large data sets
- Columns from a data structure can be deleted or inserted
- Group by data for aggregation and transformation
- High performance merging and joining and data
- Time series functionality

In [1]:
#Excel has a limit of 1M rows. Pandas can work through 100s of millions or billions of rows information
#Pandas is good to work with No SQL where data is stored as column objects rather than being stored in memory. Popular NoSQL frameworks include MangoDB and others

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
pd.__version__

'1.0.5'

In [5]:
# Panda Series
# A Pandas series is like a column in a table, 
# one-dimensional array handling data of any type.
s = pd.Series(np.arange(1,15))
s

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
dtype: int32

In [7]:
s = Series(np.arange(10,51))
s

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
15    25
16    26
17    27
18    28
19    29
20    30
21    31
22    32
23    33
24    34
25    35
26    36
27    37
28    38
29    39
30    40
31    41
32    42
33    43
34    44
35    45
36    46
37    47
38    48
39    49
40    50
dtype: int32

In [8]:
type(s)

pandas.core.series.Series

In [9]:
s.index

RangeIndex(start=0, stop=41, step=1)

In [10]:
s = Series([10,20,30,40], index=["w","x","y","z"])
s

w    10
x    20
y    30
z    40
dtype: int64

In [11]:
s["x"]

20

In [12]:
s["w"]

10

In [14]:
s = Series(np.array(['a','b','c','d']), index=np.arange(100,104))
s

100    a
101    b
102    c
103    d
dtype: object

In [15]:
s.index

Int64Index([100, 101, 102, 103], dtype='int64')

In [16]:
s.values

array(['a', 'b', 'c', 'd'], dtype=object)

In [19]:
so = Series([2520,1122, 937, 847, 713], index=['USA','Russia','Germany','UK','France'])
so

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [20]:
so['USA']

2520

In [21]:
so[0]

2520

In [22]:
so[so > 800]

USA        2520
Russia     1122
Germany     937
UK          847
dtype: int64

In [23]:
'France' in so

True

In [24]:
type(so)

pandas.core.series.Series

In [25]:
so_dict = so.to_dict()
so_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [26]:
so_from_dict = Series(so_dict)
so_from_dict

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [27]:
countries = ['Russia', 'France', 'Spain', 'Germany', 'USA', 'UK', 'Italy']

In [28]:
so2 = Series(so_dict,index=countries)
so2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [29]:
pd.isnull(so2)

Russia     False
France     False
Spain       True
Germany    False
USA        False
UK         False
Italy       True
dtype: bool

In [31]:
pd.isnull(so2[2])

True

In [49]:
arr = []

for i in so2:
    if not pd.isnull(i):
        print(i)
        arr.append(i)
arr

1122.0
713.0
937.0
2520.0
847.0

[1122.0, 713.0, 937.0, 2520.0, 847.0]

In [33]:
len(so)

5

In [36]:
len(so2)

7

In [38]:
so + so2

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2244.0
Spain         NaN
UK         1694.0
USA        5040.0
dtype: float64

In [41]:
s

100    a
101    b
102    c
103    d
dtype: object

In [43]:
so.name= "Summer Olympic"
so2.name = 'Summer Olympic'

In [44]:
so

USA        2520
Russia     1122
Germany     937
UK          847
France      713
Name: Summer Olympic, dtype: int64

In [45]:
so2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [46]:
so.index.name = "Country"
so2.index.name = "Country"

In [47]:
so

Country
USA        2520
Russia     1122
Germany     937
UK          847
France      713
Name: Summer Olympic, dtype: int64

In [48]:
so2

Country
Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [50]:
#DataFrame
# 2 dimensional data structure, like a 2 dimensional array
my_dict = {'Cars': ['GMC','Toyota','Ford'], 'Seats': [8,7,5]
    
            }

In [51]:
my_dict

{'Cars': ['GMC', 'Toyota', 'Ford'], 'Seats': [8, 7, 5]}

In [52]:
type(my_dict)

dict

In [53]:
df = DataFrame(my_dict)
df

     Cars  Seats
0     GMC      8
1  Toyota      7
2    Ford      5

In [54]:
data = {
    "Calories": [420, 380, 390],
    "Fruits": ['Orange','Banana', 'Grape']
}

df1 = DataFrame(data)

In [55]:
df1

   Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [56]:
df.describe

<bound method NDFrame.describe of      Cars  Seats
0     GMC      8
1  Toyota      7
2    Ford      5>

In [57]:
df.info

<bound method DataFrame.info of      Cars  Seats
0     GMC      8
1  Toyota      7
2    Ford      5>

In [58]:
df1.describe

<bound method NDFrame.describe of    Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape>

In [59]:
df1.info

<bound method DataFrame.info of    Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape>

In [61]:
#Locate Row in data frame
df1.loc[0]

Calories       420
Fruits      Orange
Name: 0, dtype: object

In [63]:
d = df1.loc[1]
d

Calories       380
Fruits      Banana
Name: 1, dtype: object

In [64]:
type(d)

pandas.core.series.Series

In [66]:
df1

   Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [68]:
df1.loc[[0,2]]

   Calories  Fruits
0       420  Orange
2       390   Grape

In [70]:
df1.loc[0:2]

   Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [72]:
df1.loc[0:len(df1)]

   Calories  Fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [73]:
df1.loc[0:1]

   Calories  Fruits
0       420  Orange
1       380  Banana

In [75]:
my_dict = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
              "year": [2000,2001,2002,2001,2002,2003],
               "pop" : [1.5,1.7,3.6,2.4,2.9,3.2]
          }

df2 = DataFrame(my_dict)

In [76]:
df2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [80]:
#shows top 10
df2.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [81]:
df2.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [84]:
df2.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [85]:
df2.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [88]:
df3 = DataFrame(my_dict, columns=['year','state','pop']) #reorder the columns
df3

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [89]:
df4 = DataFrame(my_dict, columns=['year','state','pop','debt'],
               index = ['one','two','three','four','five','six'])

df4

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [90]:
df4.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [92]:
df4['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [93]:
df4

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [94]:
df4.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [95]:
df4['debt']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [99]:
df4['debt'] = 10.5

In [97]:
df4

       year   state  pop  debt
one    2000    Ohio  1.5  10.5
two    2001    Ohio  1.7  10.5
three  2002    Ohio  3.6  10.5
four   2001  Nevada  2.4  10.5
five   2002  Nevada  2.9  10.5
six    2003  Nevada  3.2  10.5

In [101]:
df4['dept'] = 11
df4

       year   state  pop  debt  dept
one    2000    Ohio  1.5  10.5    11
two    2001    Ohio  1.7  10.5    11
three  2002    Ohio  3.6  10.5    11
four   2001  Nevada  2.4  10.5    11
five   2002  Nevada  2.9  10.5    11
six    2003  Nevada  3.2  10.5    11

In [102]:
df4['dept'] = np.random.randint(5,10)

In [103]:
df4

       year   state  pop  debt  dept
one    2000    Ohio  1.5  10.5     5
two    2001    Ohio  1.7  10.5     5
three  2002    Ohio  3.6  10.5     5
four   2001  Nevada  2.4  10.5     5
five   2002  Nevada  2.9  10.5     5
six    2003  Nevada  3.2  10.5     5

In [108]:
#delete dept column
del df4['dept']

KeyError: 'dept'

In [109]:
df4

       year   state  pop  debt
one    2000    Ohio  1.5     9
two    2001    Ohio  1.7     9
three  2002    Ohio  3.6     9
four   2001  Nevada  2.4     9
five   2002  Nevada  2.9     9
six    2003  Nevada  3.2     9

In [106]:
df4['debt'] = np.random.randint(5,10)

In [107]:
df4

       year   state  pop  debt
one    2000    Ohio  1.5     9
two    2001    Ohio  1.7     9
three  2002    Ohio  3.6     9
four   2001  Nevada  2.4     9
five   2002  Nevada  2.9     9
six    2003  Nevada  3.2     9

In [112]:
df4['debt'] = np.arange(0, len(df4))
df4

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [118]:
df4['debt'] = (np.random.randn(6))
df4

       year   state  pop      debt
one    2000    Ohio  1.5  0.776261
two    2001    Ohio  1.7 -0.632641
three  2002    Ohio  3.6  0.619637
four   2001  Nevada  2.4  0.432310
five   2002  Nevada  2.9  0.057102
six    2003  Nevada  3.2  0.150744

In [120]:
s = Series([-1.2,-1.5,-1.7], index=['two','four','five'])
s

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [121]:
df4['debt'] = s

In [122]:
df4

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [123]:
df4['eastern'] = df4['state'] == 'Ohio'

In [124]:
df4

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [125]:
df4.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [126]:
del df4['eastern']
df4

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN